app/Services/InventoryService.php

SELECT `u`.*, `l`.`unit_cost`, `l`.`origin_type`, `l`.`source_note`
FROM `inventory_units` `u`
JOIN `stock_lots` `l` ON `l`.`id`=`u`.`stock_lot_id`
WHERE `u`.`product_id` = 2
AND `u`.`status` = 'available'
ORDER BY `u`.`id` ASC
---
    public function availableUnits(int $productId): array
    {
        return db_connect()->table('inventory_units u')->select('u.*,l.unit_cost,l.origin_type,l.source_note')->join('stock_lots l','l.id=u.stock_lot_id')
            ->where(['u.product_id'=>$productId,'u.status'=>'available'])->orderBy('u.id','ASC')->get()->getResultArray();

SELECT *
FROM `products`
WHERE `id` = 2
---
    public function consume(int $productId,float $qty,?int $inventoryUnitId,int $saleItemId,?int $userId=null): array
    {
        $db=db_connect(); $product=$db->table('products')->where('id',$productId)->get()->getRowArray();

INSERT INTO `stock_movements` (`product_id`, `stock_lot_id`, `inventory_unit_id`, `movement_type`, `qty`, `reference_type`, `reference_id`, `unit_cost`, `notes`, `created_by`, `created_at`) VALUES (2, 3, 5, 'out', 1, 'sale_item', 10, 1499, NULL, 1, '2026-08-29 14:05:30')
---
    private function movement(int $productId,?int $lotId,?int $unitId,string $type,float $qty,?string $refType,?int $refId,float $unitCost,?string $notes,?int $userId): void
    {
        db_connect()->table('stock_movements')->insert([
            'product_id'=>$productId,'stock_lot_id'=>$lotId,'inventory_unit_id'=>$unitId,'movement_type'=>$type,'qty'=>$qty,
            'reference_type'=>$refType,'reference_id'=>$refId,'unit_cost'=>$unitCost,'notes'=>$notes,'created_by'=>$userId,'created_at'=>date('Y-m-d H:i:s')
        ]);