app/Services/InvoicePdfService.php

SELECT `s`.*, `c`.`name` `customer_name`, `c`.`phone` `customer_phone`, `c`.`email` `customer_email`, `c`.`address` `customer_address`, `c`.`gstin` `customer_gstin`
FROM `sales` `s`
JOIN `customers` `c` ON `c`.`id`=`s`.`customer_id`
WHERE `s`.`id` = 11
---
    public function generate(int $saleId, bool $forceGstClassic = false): string
    {
        $db=db_connect();
        $sale=$db->table('sales s')->select('s.*,c.name customer_name,c.phone customer_phone,c.email customer_email,c.address customer_address,c.gstin customer_gstin')->join('customers c','c.id=s.customer_id')->where('s.id',$saleId)->get()->getRowArray();
        if(!$sale) throw new RuntimeException('Sale not found for PDF generation.');
        $items=$db->table('sale_items si')->select('si.id,si.qty,si.unit_price,si.discount_amount,si.tax_percent,si.line_total,p.name,p.model,p.hsn_sac,u.imei1,u.imei2,u.serial_no,u.unique_id')->join('products p','p.id=si.product_id')->join('inventory_units u','u.id=si.inventory_unit_id','left')->where('si.sale_id',$saleId)->orderBy('si.id')->get()->getResultArray();
        $shop=$db->table('shop_settings')->where('id',1)->get()->getRowArray() ?? [];