app/Services/SaleService.php

SELECT *
FROM `shop_settings`
WHERE `id` = 1
---
    public function create(array $data, ?int $userId=null): int
    {
        $db=db_connect();
        $inventory=new InventoryService();
        $numbers=new DocumentNumberService();
        $items=$data['items']??[];
        if($items===[]) throw new RuntimeException('Add at least one sale item.');

        $shop=$db->table('shop_settings')->where('id',1)->get()->getRowArray() ?? [];