app/Controllers/Sales.php

    private function queuePaymentWhatsApp(int $saleId,float $amount): void
    {
        $db=db_connect();$sale=$db->table('sales')->where('id',$saleId)->get()->getRowArray();if(!$sale)return;$customer=$db->table('customers')->where('id',$sale['customer_id'])->get()->getRowArray();$tpl=$db->table('whatsapp_templates')->where(['event_key'=>'payment_received','is_active'=>1])->get()->getRowArray();if(!$customer||!$tpl)return;$phone=$customer['whatsapp_phone']?:$customer['phone'];if(!$phone)return;$shop=$db->table('shop_settings')->where('id',1)->get()->getRowArray();
---
SELECT *
FROM `shop_settings`
WHERE `id` = 1